#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/74ddb5e1-afa9-4871-ad5a-9a183738ef85/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/pp93w9-dev/runs/run-nxXhU6tdtSxheU65

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
random_integer.cf_origin_id: Refreshing state... [id=16]
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-capital-bedbug]
data.aws_alb.main: Reading...
module.network.data.aws_security_group.app: Reading...
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:718963518348:startup-sample-billing-alert-topic]
module.network.data.aws_security_group.data: Reading...
module.network.data.aws_vpc.main: Reading...
module.network.data.aws_security_group.web: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:cluster/sample-cluster]
data.aws_caller_identity.current: Reading...
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E215BLUBT79MFI]
data.aws_caller_identity.current: Read complete after 0s [id=718963518348]
data.aws_security_group.web: Reading...
module.network.data.aws_security_group.app: Read complete after 0s [id=sg-0255deb1cafdd216c]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-capital-bedbug]
module.network.data.aws_security_group.data: Read complete after 0s [id=sg-09a048b638b4a6487]
module.network.data.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=718963518348:startup-sample-monthly]
data.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]
data.aws_alb.main: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:loadbalancer/app/default/a4ea530f37f778f9]
data.aws_alb_listener.front_end: Reading...
data.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener/app/default/a4ea530f37f778f9/1b66860a37689d14]
module.network.data.aws_vpc.main: Read complete after 0s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet_ids.app: Reading...
module.network.data.aws_subnet_ids.data: Reading...
module.network.data.aws_subnet_ids.web: Reading...
aws_security_group.ecs_tasks: Refreshing state... [id=sg-07dd5ef1ad9659265]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:targetgroup/sample-target-group/39f45b28c94a48d6]
module.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...
module.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...
module.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener-rule/app/default/a4ea530f37f778f9/1b66860a37689d14/d80b5be6ad952c21]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220721233639099500000002]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "718963518348:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:f99a10dd5440543005359d3c440b2718bbc86c51" -> "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:7a99dc34928e686c3bada2212496307325b7fbf0"
                    name             = "sample-client-app"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sample-app-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_budgets_budget.cost,
│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":
│   19:   cost_filters = {
│   20:     TagKeyValue = "user:Project$Startup Sample"
│   21:   }
│ 
│ Use the attribute "cost_filter" instead.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.network.data.aws_subnet_ids.web,
│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
│   31: data "aws_subnet_ids" "web" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and 5 more similar warnings elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.180320000000000144/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/pp93w9-dev/runs/run-nxXhU6tdtSxheU65%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.2.5%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=16]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-capital-bedbug]%0Adata.aws_alb.main: Reading...%0Amodule.network.data.aws_security_group.app: Reading...%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:718963518348:startup-sample-billing-alert-topic]%0Amodule.network.data.aws_security_group.data: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Amodule.network.data.aws_security_group.web: Reading...%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:cluster/sample-cluster]%0Adata.aws_caller_identity.current: Reading...%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E215BLUBT79MFI]%0Adata.aws_caller_identity.current: Read complete after 0s [id=718963518348]%0Adata.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.app: Read complete after 0s [id=sg-0255deb1cafdd216c]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-capital-bedbug]%0Amodule.network.data.aws_security_group.data: Read complete after 0s [id=sg-09a048b638b4a6487]%0Amodule.network.data.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=718963518348:startup-sample-monthly]%0Adata.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]%0Adata.aws_alb.main: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:loadbalancer/app/default/a4ea530f37f778f9]%0Adata.aws_alb_listener.front_end: Reading...%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener/app/default/a4ea530f37f778f9/1b66860a37689d14]%0Amodule.network.data.aws_vpc.main: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Reading...%0Amodule.network.data.aws_subnet_ids.data: Reading...%0Amodule.network.data.aws_subnet_ids.web: Reading...%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-07dd5ef1ad9659265]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:targetgroup/sample-target-group/39f45b28c94a48d6]%0Amodule.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...%0Amodule.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...%0Amodule.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener-rule/app/default/a4ea530f37f778f9/1b66860a37689d14/d80b5be6ad952c21]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220721233639099500000002]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "718963518348:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        id                                 = "arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)%0A        # (13 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:f99a10dd5440543005359d3c440b2718bbc86c51" -> "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:7a99dc34928e686c3bada2212496307325b7fbf0"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 1 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/pp93w9-dev/runs/run-nxXhU6tdtSxheU65%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.2.5%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=16]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-capital-bedbug]%0Adata.aws_alb.main: Reading...%0Amodule.network.data.aws_security_group.app: Reading...%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:718963518348:startup-sample-billing-alert-topic]%0Amodule.network.data.aws_security_group.data: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Amodule.network.data.aws_security_group.web: Reading...%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:cluster/sample-cluster]%0Adata.aws_caller_identity.current: Reading...%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E215BLUBT79MFI]%0Adata.aws_caller_identity.current: Read complete after 0s [id=718963518348]%0Adata.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.app: Read complete after 0s [id=sg-0255deb1cafdd216c]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-capital-bedbug]%0Amodule.network.data.aws_security_group.data: Read complete after 0s [id=sg-09a048b638b4a6487]%0Amodule.network.data.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=718963518348:startup-sample-monthly]%0Adata.aws_security_group.web: Read complete after 0s [id=sg-04fba1a9e4941b2c4]%0Adata.aws_alb.main: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:loadbalancer/app/default/a4ea530f37f778f9]%0Adata.aws_alb_listener.front_end: Reading...%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener/app/default/a4ea530f37f778f9/1b66860a37689d14]%0Amodule.network.data.aws_vpc.main: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Reading...%0Amodule.network.data.aws_subnet_ids.data: Reading...%0Amodule.network.data.aws_subnet_ids.web: Reading...%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-07dd5ef1ad9659265]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:targetgroup/sample-target-group/39f45b28c94a48d6]%0Amodule.network.data.aws_subnet_ids.web: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...%0Amodule.network.data.aws_subnet_ids.app: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...%0Amodule.network.data.aws_subnet_ids.data: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:718963518348:listener-rule/app/default/a4ea530f37f778f9/1b66860a37689d14/d80b5be6ad952c21]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220721233639099500000002]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "718963518348:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        id                                 = "arn:aws:ecs:ca-central-1:718963518348:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)%0A        # (13 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:718963518348:task-definition/sample-app-task:1" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:f99a10dd5440543005359d3c440b2718bbc86c51" -> "673638668652.dkr.ecr.ca-central-1.amazonaws.com/ssp:7a99dc34928e686c3bada2212496307325b7fbf0"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 1 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

#### Architecture Diagram

![img](null)

*Pusher:* @vivid-cpreston, *Action:* [Terraform Plan: #1](https://github.com/vivid-cpreston/startup-sample-project-aws-containers/actions/runs/2715348583)